# GetClTextureC

## Description
Function GetClTextureC returns the wall center texture of the specified class.

```pascal
FUNCTION GetClTextureC(className : STRING) : LONGINT;
```

```python

def vs.GetClTextureC(className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|

## Remarks
Returns the wall center textureof the class named className.

## Version
Availability: from VectorWorks8.0
## Category
* Textures